Ward-Moeyersons/STM32_Configurator/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f7xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define D15_Pin GPIO_PIN_8
#define D15_GPIO_Port GPIOB
#define D3_Pin GPIO_PIN_4
#define D3_GPIO_Port GPIOB
#define D9_Pin GPIO_PIN_15
#define D9_GPIO_Port GPIOA
#define D14_Pin GPIO_PIN_9
#define D14_GPIO_Port GPIOB
#define D7_Pin GPIO_PIN_3
#define D7_GPIO_Port GPIOI
#define D8_Pin GPIO_PIN_2
#define D8_GPIO_Port GPIOI
#define D13_Pin GPIO_PIN_1
#define D13_GPIO_Port GPIOI
#define D5_Pin GPIO_PIN_0
#define D5_GPIO_Port GPIOI
#define BTN_Pin GPIO_PIN_11
#define BTN_GPIO_Port GPIOI
#define D10_Pin GPIO_PIN_8
#define D10_GPIO_Port GPIOA
#define D0_Pin GPIO_PIN_7
#define D0_GPIO_Port GPIOC
#define D1_Pin GPIO_PIN_6
#define D1_GPIO_Port GPIOC
#define D4_Pin GPIO_PIN_7
#define D4_GPIO_Port GPIOG
#define D2_Pin GPIO_PIN_6
#define D2_GPIO_Port GPIOG
#define A4_Pin GPIO_PIN_7
#define A4_GPIO_Port GPIOF
#define A5_Pin GPIO_PIN_6
#define A5_GPIO_Port GPIOF
#define A1_Pin GPIO_PIN_10
#define A1_GPIO_Port GPIOF
#define A2_Pin GPIO_PIN_9
#define A2_GPIO_Port GPIOF
#define A3_Pin GPIO_PIN_8
#define A3_GPIO_Port GPIOF
#define A0_Pin GPIO_PIN_0
#define A0_GPIO_Port GPIOA
#define D6_Pin GPIO_PIN_6
#define D6_GPIO_Port GPIOH
#define D12_Pin GPIO_PIN_14
#define D12_GPIO_Port GPIOB
#define D11_Pin GPIO_PIN_15
#define D11_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
